# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shopify/shopify'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development Environment
brew 'php'
brew 'php@8.1'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'mariadb'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'nvm'
brew 'themekit'

# Productivity Apps
cask '1password' # Password Management
cask 'keepingyouawake' # Prevents system from going to sleep
cask 'the-unarchiver' # ZIP / RAR
cask 'microsoft-auto-update'
cask 'microsoft-office'
cask 'google-drive'
cask 'dropbox'
cask 'notion'
cask 'contexts' # Better app switching
# cask 'alfred' # Spotlight replacement
cask 'raycast'
cask 'bartender'
cask 'appcleaner' # Application unistaller
cask 'fantastical' # Calendar
cask 'parallels' # VMs

# Chats, Messaging & Social Media
cask 'discord'
cask 'whatsapp'
cask 'microsoft-teams'
cask 'slack'
cask 'zoom'

# Development Tools
cask 'visual-studio-code'
cask 'webstorm'
cask 'tableplus' # Database Administration Tool
cask 'dbngin' # Database Server Management
cask 'insomnia' # API Design & Testing
cask 'docker'
cask 'helo' # E-Mail Testing
cask 'phpmon' # Local PHP Monitoring & Version Switching
cask 'transmit' # FTP Client
cask 'tinkerwell' # Quick PHP Snippet Testing
cask 'termius' # SSH Client
cask 'tower' # Git Client
cask 'kaleidoscope' # Diff visualizer & Merge Helper

# Design, Video & Graphics
cask 'figma'
cask 'sketch'
cask 'imageoptim'
cask 'kap' # Screen Recording
cask 'adobe-creative-cloud'
cask 'iina' # Video Player
cask 'vlc' # Video Player
cask 'handbrake' # Video conversion
cask 'sip' # Color picker
cask 'shottr' # Screenshot tool

# Browsers & Web
cask 'google-chrome'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'opera'
cask 'brave-browser'
cask 'surfshark' # VPN Provider / Client
cask 'viscosity' # VPN Client
cask 'raindropio' # Bookmark Manager
cask 'little-snitch' # Connectivity Monitor / Firewall

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Others
cask 'spotify'
cask 'pocket-casts'
cask 'ledger-live'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 361309726
mas 'Magnet', id: 441258766 # Window Manager
mas 'Craft', id: 1487937127 # Document Building
mas 'Canary Mail', id: 1236045954 # Mails
mas 'Paste', id: 967805235 # Clipboard Manager
mas 'MindNode', id: 1218718027 # Flowcharts & Sitemaps
mas 'Dropover', id: 1355679052 # Files sammeln und gleichzeitig verarbeiten
